In [41]:
import pandas as pd

staff_df = pd.DataFrame([{'Name':'Kelly','Role':'Director of HR'},
                         {'Name':'Sally','Role':'Course liasion'},
                          {'Name':'James','Role':'Grader'}])

staff_df = staff_df.set_index('Name')

student_df = pd.DataFrame([{'Name':'James','School':'Business'},
                         {'Name':'Mike','School':'Law'},
                          {'Name':'Sally','School':'Engineering'}])

student_df=student_df.set_index('Name')

print(staff_df.head())
print(student_df.head())

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader
            School
Name
James     Business
Mike           Law
Sally  Engineering

In [42]:
pd.merge(staff_df, student_df,how='outer',left_index=True,right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [43]:
pd.merge(staff_df, student_df,how='inner',left_index=True,right_index=True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [44]:
pd.merge(staff_df, student_df,how='left',left_index=True,right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

In [45]:
pd.merge(staff_df, student_df,how='right',left_index=True,right_index=True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

In [46]:
staff_df=staff_df.reset_index()
student_df=student_df.reset_index()
staff_df

    Name            Role
0  Kelly  Director of HR
1  Sally  Course liasion
2  James          Grader

In [47]:
pd.merge(staff_df,student_df, how='right',on='Name')

    Name            Role       School
0  James          Grader     Business
1   Mike             NaN          Law
2  Sally  Course liasion  Engineering

In [49]:
staff_df=pd.DataFrame([{'Name':'Kelly','Role':'Director of HR',
                       'Location':'State Street'},
                      {'Name':'Sally','Role':'Course Liasion',
                      'Location':'Washington Avenue'},
                      {'Name':'James','Role':'Grader',
                      'Location':'Washington Avenue'}])